# -*- encoding: utf-8 -*-

__author__ = "David Michael Brown"
__status__ = "Development"

STRESS = u'\u02c8' 
PERIOD = u'\u2016'
COMMA = u'|'
SYLLABLE = u'.'

IPA_SYMBOLS = [u't',u'd',u's',u'z',u'ɬ',u'ɮ',u'θ',u'ð',u'ʃ',u'ʒ',u'c',u'ɟ',u'ç',u'ʝ',u'p',u'b',u'f',u'v',
				u'ɸ',u'β',u'k',u'ɡ',u'x',u'ɣ',u'q',u'ɢ',u'χ',u'ʁ',u'ħ',u'ʕ',u'h',u'ɦ',u'ʔ',u'ʧ',u'ʤ',
				u'ʦ',u'ʣ',u'm',u'n',u'ŋ',u'ɳ',u'ɲ',u'ɴ',u'l',u'ʎ',u'ɾ',u'r',u'ɹ',u'ʀ',u'j',u'w',
				u'ɥ',u'ɰ',u'i',u'ɪ',u'u',u'ʊ',u'e',u'ɛ',u'o',u'ɔ',u'a',u'æ',u'y',u'ʏ',u'ø',u'œ',u'ə',u'ɯ']

VOWELLS = ["j","w","ɥ","ɰ","i","ɪ","u","ʊ","e","ɛ","o","ɔ","a","æ","y","ʏ","ø","œ","ə","ɯ"]
CONSONANTS = ["t","d","s","z","ɬ","ɮ","θ","ð","ʃ","ʒ","c","ɟ","ç","ʝ","p","b","f","v",
				"ɸ","β","k","ɡ","x","ɣ","q","ɢ","χ","ʁ","ħ","ʕ","h","ɦ","ʔ","ʧ","ʤ",
				"ʦ","ʣ","m","n","ŋ","ɳ","ɲ","ɴ","l","ʎ","ɾ","r","ɹ","ʀ"]



